jarico/URpilot-Software/Core/Startup/startup_stm32f767vgtx.s
/***************************************************************************************
**  startup_stm32f767vgtx.s - Fichero de inicio del programa
**
**
**  Este fichero forma parte del proyecto URpilot.
**  Codigo desarrollado por el grupo de investigacion ICON de la Universidad de La Rioja
**
**  Autor: Ramon Rico
**  Fecha de creacion: 04/12/2020
**  Fecha de modificacion: 04/12/2020
**
**  El proyecto URpilot NO es libre. No se puede distribuir y/o modificar este fichero
**  bajo ningun concepto.
**
**  En caso de modificacion y/o solicitud de informacion pongase en contacto con
**  el grupo de investigacion ICON a traves de: www.unirioja.es/urpilot
**
**
**  Control de versiones del fichero
**
**  v1.0  Ramon Rico. Se ha liberado la primera version estable
**
****************************************************************************************/
    
.syntax unified
.cpu cortex-m7
.fpu softvfp
.thumb

.global  g_pfnVectors
.global  Default_Handler

.word  _sidata         // Direccion inicio seccion .data
.word  _sdata          // Direccion inicio seccion .data
.word  _edata          // Direccion fin seccion .data
.word  _sbss           // Direccion inicio seccion .bss
.word  _ebss           // Direccion fin seccion .bss
.word  _sdataSRAM2     // Direccion inicio seccion .sdataSRAM2
.word  _edataSRAM2     // Direccion fin seccion .sdataSRAM2
.word  _sdataDTCM_RAM  // Direccion inicio seccion .dataDTCM_RAM
.word  _edataDTCM_RAM  // Direccion fin seccion .dataDTCM_RAM
// stack usado por SystemInit_ExtMemCtl/


/***************************************************************************************
**  Nombre:         Reset_Handler
**  Descripcion:    Este es el codigo que se ejecuta al principio de todo
**  Parametros:     Ninguno
**  Retorno:        Ninguno
****************************************************************************************/
.section  .text.Reset_Handler
.weak  Reset_Handler
.type  Reset_Handler, %function

Reset_Handler:  
    ldr   sp, =_estack      // Ajusta el puntero stack

// Memoria SRAM1
// Se copian los datos de la flash a la RAM
    movs  r1, #0
    b  LoopCopyDataInit

  CopyDataInit:
    ldr  r3, =_sidata
    ldr  r3, [r3, r1]
    str  r3, [r0, r1]
    adds  r1, r1, #4

  LoopCopyDataInit:
    ldr  r0, =_sdata
    ldr  r3, =_edata
    adds  r2, r0, r1
    cmp  r2, r3
    bcc  CopyDataInit
    ldr  r2, =_sbss
    b  LoopFillZerobss
    
// Rellena de ceros la seccion .bss
  FillZerobss:
    movs  r3, #0
    str  r3, [r2], #4
    
  LoopFillZerobss:
    ldr  r3, = _ebss
    cmp  r2, r3
    bcc  FillZerobss

// Memoria SRAM2
    ldr  r2, =_ssram2_data
    b  LoopFillZerosram2
// Rellena de ceros la seccion .bssSRAM2
  FillZerosram2:
    movs  r3, #0
    str  r3, [r2], #4

  LoopFillZerosram2:
    ldr  r3, = _esram2_data
    cmp  r2, r3
    bcc  FillZerosram2

// Memoria DTCM_RAM
    ldr  r2, =_sramRapida_data
    b  LoopFillZeroDTCM_RAM
// Rellena de ceros la seccion .bssDTCM_RAM
  FillZeroDTCM_RAM:
    movs  r3, #0
    str  r3, [r2], #4

  LoopFillZeroDTCM_RAM:
    ldr  r3, = _eramRapida_data
    cmp  r2, r3
    bcc  FillZeroDTCM_RAM

// Programa
    bl  SystemInit   // Llamada a la funcion SystemInit
    bl  main         // Llamada a la funcion main
    bx  lr
.size  Reset_Handler, .-Reset_Handler


/***************************************************************************************
**  Nombre:         Default_Handler
**  Descripcion:    Bucle infinito por si ocurre una excepcion inesperada
**  Parametros:     Ninguno
**  Retorno:        Ninguno
****************************************************************************************/
.section  .text.Default_Handler,"ax",%progbits
Default_Handler:
  Infinite_Loop:
    b  Infinite_Loop
.size  Default_Handler, .-Default_Handler


/***************************************************************************************
**  Nombre:         Vectores
**  Descripcion:    Tabla de vectores.
****************************************************************************************/
.section  .isr_vector,"a",%progbits
    .type  g_pfnVectors, %object
    .size  g_pfnVectors, .-g_pfnVectors
   
g_pfnVectors:
    .word  _estack
    .word  Reset_Handler

    .word  NMI_Handler
    .word  HardFault_Handler
    .word  MemManage_Handler
    .word  BusFault_Handler
    .word  UsageFault_Handler
    .word  0
    .word  0
    .word  0
    .word  0
    .word  SVC_Handler
    .word  DebugMon_Handler
    .word  0
    .word  PendSV_Handler
    .word  SysTick_Handler
  
// Interrupciones externas
    .word     WWDG_IRQHandler                   /* Window WatchDog              */
    .word     PVD_IRQHandler                    /* PVD through EXTI Line detection */
    .word     TAMP_STAMP_IRQHandler             /* Tamper and TimeStamps through the EXTI line */
    .word     RTC_WKUP_IRQHandler               /* RTC Wakeup through the EXTI line */
    .word     FLASH_IRQHandler                  /* FLASH                        */
    .word     RCC_IRQHandler                    /* RCC                          */
    .word     EXTI0_IRQHandler                  /* EXTI Line0                   */
    .word     EXTI1_IRQHandler                  /* EXTI Line1                   */
    .word     EXTI2_IRQHandler                  /* EXTI Line2                   */
    .word     EXTI3_IRQHandler                  /* EXTI Line3                   */
    .word     EXTI4_IRQHandler                  /* EXTI Line4                   */
    .word     DMA1_Stream0_IRQHandler           /* DMA1 Stream 0                */
    .word     DMA1_Stream1_IRQHandler           /* DMA1 Stream 1                */
    .word     DMA1_Stream2_IRQHandler           /* DMA1 Stream 2                */
    .word     DMA1_Stream3_IRQHandler           /* DMA1 Stream 3                */
    .word     DMA1_Stream4_IRQHandler           /* DMA1 Stream 4                */
    .word     DMA1_Stream5_IRQHandler           /* DMA1 Stream 5                */
    .word     DMA1_Stream6_IRQHandler           /* DMA1 Stream 6                */
    .word     ADC_IRQHandler                    /* ADC1, ADC2 and ADC3s         */
    .word     CAN1_TX_IRQHandler                /* CAN1 TX                      */
    .word     CAN1_RX0_IRQHandler               /* CAN1 RX0                     */
    .word     CAN1_RX1_IRQHandler               /* CAN1 RX1                     */
    .word     CAN1_SCE_IRQHandler               /* CAN1 SCE                     */
    .word     EXTI9_5_IRQHandler                /* External Line[9:5]s          */
    .word     TIM1_BRK_TIM9_IRQHandler          /* TIM1 Break and TIM9          */
    .word     TIM1_UP_TIM10_IRQHandler          /* TIM1 Update and TIM10        */
    .word     TIM1_TRG_COM_TIM11_IRQHandler     /* TIM1 Trigger and Commutation and TIM11 */
    .word     TIM1_CC_IRQHandler                /* TIM1 Capture Compare         */
    .word     TIM2_IRQHandler                   /* TIM2                         */
    .word     TIM3_IRQHandler                   /* TIM3                         */
    .word     TIM4_IRQHandler                   /* TIM4                         */
    .word     I2C1_EV_IRQHandler                /* I2C1 Event                   */
    .word     I2C1_ER_IRQHandler                /* I2C1 Error                   */
    .word     I2C2_EV_IRQHandler                /* I2C2 Event                   */
    .word     I2C2_ER_IRQHandler                /* I2C2 Error                   */
    .word     SPI1_IRQHandler                   /* SPI1                         */
    .word     SPI2_IRQHandler                   /* SPI2                         */
    .word     USART1_IRQHandler                 /* USART1                       */
    .word     USART2_IRQHandler                 /* USART2                       */
    .word     USART3_IRQHandler                 /* USART3                       */
    .word     EXTI15_10_IRQHandler              /* External Line[15:10]s        */
    .word     RTC_Alarm_IRQHandler              /* RTC Alarm (A and B) through EXTI Line */
    .word     OTG_FS_WKUP_IRQHandler            /* USB OTG FS Wakeup through EXTI line */
    .word     TIM8_BRK_TIM12_IRQHandler         /* TIM8 Break and TIM12         */
    .word     TIM8_UP_TIM13_IRQHandler          /* TIM8 Update and TIM13        */
    .word     TIM8_TRG_COM_TIM14_IRQHandler     /* TIM8 Trigger and Commutation and TIM14 */
    .word     TIM8_CC_IRQHandler                /* TIM8 Capture Compare         */
    .word     DMA1_Stream7_IRQHandler           /* DMA1 Stream7                 */
    .word     FMC_IRQHandler                    /* FMC                          */
    .word     SDMMC1_IRQHandler                 /* SDMMC1                       */
    .word     TIM5_IRQHandler                   /* TIM5                         */
    .word     SPI3_IRQHandler                   /* SPI3                         */
    .word     UART4_IRQHandler                  /* UART4                        */
    .word     UART5_IRQHandler                  /* UART5                        */
    .word     TIM6_DAC_IRQHandler               /* TIM6 and DAC1&2 underrun errors */
    .word     TIM7_IRQHandler                   /* TIM7                         */
    .word     DMA2_Stream0_IRQHandler           /* DMA2 Stream 0                */
    .word     DMA2_Stream1_IRQHandler           /* DMA2 Stream 1                */
    .word     DMA2_Stream2_IRQHandler           /* DMA2 Stream 2                */
    .word     DMA2_Stream3_IRQHandler           /* DMA2 Stream 3                */
    .word     DMA2_Stream4_IRQHandler           /* DMA2 Stream 4                */
    .word     ETH_IRQHandler                    /* Ethernet                     */
    .word     ETH_WKUP_IRQHandler               /* Ethernet Wakeup through EXTI line */
    .word     CAN2_TX_IRQHandler                /* CAN2 TX                      */
    .word     CAN2_RX0_IRQHandler               /* CAN2 RX0                     */
    .word     CAN2_RX1_IRQHandler               /* CAN2 RX1                     */
    .word     CAN2_SCE_IRQHandler               /* CAN2 SCE                     */
    .word     OTG_FS_IRQHandler                 /* USB OTG FS                   */
    .word     DMA2_Stream5_IRQHandler           /* DMA2 Stream 5                */
    .word     DMA2_Stream6_IRQHandler           /* DMA2 Stream 6                */
    .word     DMA2_Stream7_IRQHandler           /* DMA2 Stream 7                */
    .word     USART6_IRQHandler                 /* USART6                       */
    .word     I2C3_EV_IRQHandler                /* I2C3 event                   */
    .word     I2C3_ER_IRQHandler                /* I2C3 error                   */
    .word     OTG_HS_EP1_OUT_IRQHandler         /* USB OTG HS End Point 1 Out   */
    .word     OTG_HS_EP1_IN_IRQHandler          /* USB OTG HS End Point 1 In    */
    .word     OTG_HS_WKUP_IRQHandler            /* USB OTG HS Wakeup through EXTI */
    .word     OTG_HS_IRQHandler                 /* USB OTG HS                   */
    .word     DCMI_IRQHandler                   /* DCMI                         */
    .word     0                                 /* Reserved                     */
    .word     RNG_IRQHandler                    /* RNG                          */
    .word     FPU_IRQHandler                    /* FPU                          */
    .word     UART7_IRQHandler                  /* UART7                        */
    .word     UART8_IRQHandler                  /* UART8                        */
    .word     SPI4_IRQHandler                   /* SPI4                         */
    .word     SPI5_IRQHandler                   /* SPI5                         */
    .word     SPI6_IRQHandler                   /* SPI6                         */
    .word     SAI1_IRQHandler                   /* SAI1                         */
    .word     LTDC_IRQHandler                   /* LTDC                         */
    .word     LTDC_ER_IRQHandler                /* LTDC error                   */
    .word     DMA2D_IRQHandler                  /* DMA2D                        */
    .word     SAI2_IRQHandler                   /* SAI2                         */
    .word     QUADSPI_IRQHandler                /* QUADSPI                      */
    .word     LPTIM1_IRQHandler                 /* LPTIM1                       */
    .word     CEC_IRQHandler                    /* HDMI_CEC                     */
    .word     I2C4_EV_IRQHandler                /* I2C4 Event                   */
    .word     I2C4_ER_IRQHandler                /* I2C4 Error                   */
    .word     SPDIF_RX_IRQHandler               /* SPDIF_RX                     */
    .word     0                                 /* Reserved                     */
    .word     DFSDM1_FLT0_IRQHandler            /* DFSDM1 Filter 0 global Interrupt */
    .word     DFSDM1_FLT1_IRQHandler            /* DFSDM1 Filter 1 global Interrupt */
    .word     DFSDM1_FLT2_IRQHandler            /* DFSDM1 Filter 2 global Interrupt */
    .word     DFSDM1_FLT3_IRQHandler            /* DFSDM1 Filter 3 global Interrupt */
    .word     SDMMC2_IRQHandler                 /* SDMMC2                       */
    .word     CAN3_TX_IRQHandler                /* CAN3 TX                      */
    .word     CAN3_RX0_IRQHandler               /* CAN3 RX0                     */
    .word     CAN3_RX1_IRQHandler               /* CAN3 RX1                     */
    .word     CAN3_SCE_IRQHandler               /* CAN3 SCE                     */
    .word     JPEG_IRQHandler                   /* JPEG                         */
    .word     MDIOS_IRQHandler                  /* MDIOS                        */


/***************************************************************************************
**  Se asigna el atributo weak para los handler de las excepciones para sobreescribir las
**  funciones.
****************************************************************************************/
   .weak      NMI_Handler
   .thumb_set NMI_Handler,Default_Handler
  
   .weak      HardFault_Handler
   .thumb_set HardFault_Handler,Default_Handler
  
   .weak      MemManage_Handler
   .thumb_set MemManage_Handler,Default_Handler
  
   .weak      BusFault_Handler
   .thumb_set BusFault_Handler,Default_Handler

   .weak      UsageFault_Handler
   .thumb_set UsageFault_Handler,Default_Handler

   .weak      SVC_Handler
   .thumb_set SVC_Handler,Default_Handler

   .weak      DebugMon_Handler
   .thumb_set DebugMon_Handler,Default_Handler

